In [2]:
# Step 1: importing required modules
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv("https://raw.githubusercontent.com/dipaish/data_analysis/main/covid_finland_cleaning.csv")

In [4]:
data.head()

,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2019,continentExp,Cumulative_number_for_14_days_of_COVID-19_cases_per_100000
0,7/11/2020,11,7,2020,6.0,0,Finland,FI,FIN,5517919,Europe,1.594804
1,7/10/2020,10,7,2020,8.0,0,Finland,FI,FIN,5517919,Europe,1.830400
2,7/9/2020,9,7,2020,3.0,0,Finland,FI,FIN,5517919,Europe,1.776032
3,7/8/2020,8,7,2020,5.0,0,Finland,FI,FIN,5517919,Europe,1.939137
4,7/7/2020,7,7,2020,4.0,0,Finland,FI,FIN,5517919,Europe,2.047873

In [5]:
data.columns
data.shape
df1 = data[['dateRep', 'cases', 'deaths']]
print(df1)
df1.head(10)

       dateRep  cases  deaths
0    7/11/2020    6.0       0
1    7/10/2020    8.0       0
2     7/9/2020    3.0       0
3     7/8/2020    5.0       0
4     7/7/2020    4.0       0
..         ...    ...     ...
155   2/3/2020    0.0       0
156   2/2/2020    0.0       0
157   2/1/2020    0.0       0
158  1/31/2020    0.0       0
159  1/30/2020    1.0       0

[160 rows x 3 columns]

     dateRep  cases  deaths
0  7/11/2020    6.0       0
1  7/10/2020    8.0       0
2   7/9/2020    3.0       0
3   7/8/2020    5.0       0
4   7/7/2020    4.0       0
5   7/6/2020    5.0       0
6   7/5/2020    6.0       0
7   7/4/2020    NaN       1
8   7/3/2020    5.0       0
9   7/2/2020   22.0       0

In [6]:
df2 = df1[(df1['deaths'] >= 1)]
df2.head()

      dateRep  cases  deaths
7    7/4/2020    NaN       1
14  6/27/2020   19.0       1
18  6/23/2020    1.0       1
26  6/15/2020   17.0       1
29  6/12/2020   24.0       1

In [7]:
# Making random samples
sample1 = df1.sample(5)
sample1

       dateRep  cases  deaths
3     7/8/2020    5.0       0
52   5/20/2020   19.0       1
2     7/9/2020    3.0       0
22   6/19/2020    0.0       0
136  2/22/2020    0.0       0

In [8]:
# Data types
data.dtypes #This is how we check for the data types in the data set.

dateRep                                                        object
day                                                             int64
month                                                           int64
year                                                            int64
cases                                                         float64
deaths                                                          int64
countriesAndTerritories                                        object
geoId                                                          object
countryterritoryCode                                           object
popData2019                                                     int64
continentExp                                                   object
Cumulative_number_for_14_days_of_COVID-19_cases_per_100000    float64
dtype: object

In [9]:
# To get the missing data
missing_count = data.isnull().sum()
print(missing_count)

dateRep                                                       0
day                                                           0
month                                                         0
year                                                          0
cases                                                         7
deaths                                                        0
countriesAndTerritories                                       0
geoId                                                         0
countryterritoryCode                                          0
popData2019                                                   0
continentExp                                                  0
Cumulative_number_for_14_days_of_COVID-19_cases_per_100000    0
dtype: int64

In [10]:
# #We can see that 7 missing values in cases
#When working with huge dataset it may be helpful to see what
#percentage of the data is missing

total_data=np.product(data.shape)
total_missing=missing_count.sum()
per_of_missing_data=(total_missing/total_data)* 100
print(per_of_missing_data)

#Conclusion: as you can see we have a very small percentage
#of missing data, we may delete those rows or fill them up

0.3645833333333333

In [11]:
data["geoId"].unique()

array(['FI'], dtype=object)

In [12]:
# lets create a new data frame by dropping all null values
data1=data.dropna(axis=0, how='any') # axis=0 means rows are taken into account and how='any': a row is dropped if it contains at least one NaN value.
data1.head()
data1.shape

(153, 12)

In [13]:
data2=data.dropna(axis=1, how='any') # axis=0 means rows are taken into account and how='any': a row is dropped if it contains at least one NaN value.
data2.head()
data2.shape

(160, 11)

In [14]:
# Examples Removing duplicate values

df = pd.DataFrame ({
    'name': ['Johanna'] * 3 + ['Pekka'] * 2 + ['Andrew', 'Ben', 'Matthew'],
    'courseName': ['Data Processing'] * 8,
    'grade': [1,1,1,3,3,5,5,4]
})
df

      name       courseName  grade
0  Johanna  Data Processing      1
1  Johanna  Data Processing      1
2  Johanna  Data Processing      1
3    Pekka  Data Processing      3
4    Pekka  Data Processing      3
5   Andrew  Data Processing      5
6      Ben  Data Processing      5
7  Matthew  Data Processing      4

In [15]:
df.duplicated

<bound method DataFrame.duplicated of       name       courseName  grade
0  Johanna  Data Processing      1
1  Johanna  Data Processing      1
2  Johanna  Data Processing      1
3    Pekka  Data Processing      3
4    Pekka  Data Processing      3
5   Andrew  Data Processing      5
6      Ben  Data Processing      5
7  Matthew  Data Processing      4>

In [16]:
#by default drop_duplicates() method removes duplicate rows based on all columns
df.drop_duplicates()

      name       courseName  grade
0  Johanna  Data Processing      1
3    Pekka  Data Processing      3
5   Andrew  Data Processing      5
6      Ben  Data Processing      5
7  Matthew  Data Processing      4

In [17]:
#to remove duplicates on specific column(s)
df.drop_duplicates(subset=['courseName'])

      name       courseName  grade
0  Johanna  Data Processing      1

In [18]:
# to remove duplicates and keep the first occurence
df.drop_duplicates(subset=['name','courseName'], keep='first')

      name       courseName  grade
0  Johanna  Data Processing      1
3    Pekka  Data Processing      3
5   Andrew  Data Processing      5
6      Ben  Data Processing      5
7  Matthew  Data Processing      4

In [19]:
# to remove duplicates and keep the last occurence
df.drop_duplicates(subset=['name','courseName'], keep='last')

      name       courseName  grade
2  Johanna  Data Processing      1
4    Pekka  Data Processing      3
5   Andrew  Data Processing      5
6      Ben  Data Processing      5
7  Matthew  Data Processing      4

In [20]:
# dropping all duplicate values that is rows having same name
#and coursename are removed to create a new data frame,
#since keep=false it will remove all occurences of duplicate values
df.drop_duplicates(subset=['name','courseName'], keep=False, inplace=True)
df
#check the output by recreating the dataframe and changing inplace=False

      name       courseName  grade
5   Andrew  Data Processing      5
6      Ben  Data Processing      5
7  Matthew  Data Processing      4

In [21]:
# Detecting & Filtering Outliers

In [22]:
### Using Box Plots to identify the outlier
# Individual data points beyond the whiskers are shown as dots and are considered potential outliers.
# Example 1 : Covid cases dataframe
import matplotlib.pyplot as plt
data.boxplot(column = 'cases')
plt.show()

ModuleNotFoundError: No module named 'matplotlib'

In [23]:
# Example 2: Idenftifying possible outliers.
data = {
    'Group_A': [20, 25, 30, 35, 40, 45, 50, 55, 60, 200],
    'Group_B': [25, 30, 35, 40, 45, 50, 55, 60, 65, 150],
    'Group_C': [30, 35, 40, 45, 50, 55, 60, 65, 70, 200]
}

df = pd.DataFrame(data)

# Create a box plot
plt.boxplot(df.values, labels=df.columns)
plt.title('Box Plot of Groups')
plt.xlabel('Groups')
plt.ylabel('Values')
plt.show()

NameError: name 'plt' is not defined

In [24]:
# Another Example of binning  with cut

# Lets make a simple dataframe
ages = {'age':[21, 23, 35, 36, 21, 23, 47, 35, 63, 43, 49, 33,47, 35, 63, 43, 49, 33]}
df_ages = pd.DataFrame(ages)
# to divide them into bins of 20 - 25, 26 - 35 , 36- 45 & > 46, define the bin edges
bins = [20,25,35,45,90]

# lets create lables for each bin
labels = ['Young', 'Adult', 'MiddleAged', 'Elderly']

# we will use cut function to bin
df_ages['AgeGroup'] = pd.cut(df_ages['age'], bins=bins, labels=labels, right=False)

# Get the list of categories
categories_list = df_ages['AgeGroup'].cat.categories.tolist()
print(categories_list)

# Count the values in each bin
bin_counts = df_ages['AgeGroup'].value_counts()
print(bin_counts)

['Young', 'Adult', 'MiddleAged', 'Elderly']
AgeGroup
MiddleAged    6
Elderly       6
Young         4
Adult         2
Name: count, dtype: int64

In [26]:
ages = {'age':[21, 23, 35, 36, 21, 23, 47, 35, 63, 43, 49, 33,47, 35, 63, 43, 49, 33]}
df_ages = pd.DataFrame(ages)
# to divide them into bins of 20 - 25, 26 - 35 , 36- 45 & > 46, define the bin edges
bins = [20,25,35,45,90]

# define some labels
labels = ['Young', 'Adult', 'MiddleAged', 'Elderly']
df_ages ['AgeGroup'] = pd.cut(df_ages['age'], bins = bins, labels= labels, right= False)
df_ages

    age    AgeGroup
0    21       Young
1    23       Young
2    35  MiddleAged
3    36  MiddleAged
4    21       Young
5    23       Young
6    47     Elderly
7    35  MiddleAged
8    63     Elderly
9    43  MiddleAged
10   49     Elderly
11   33       Adult
12   47     Elderly
13   35  MiddleAged
14   63     Elderly
15   43  MiddleAged
16   49     Elderly
17   33       Adult

In [28]:
import numpy as np

In [29]:
# Creating a one dimensional array array
nump1 = np.array([1, 2, 3, 4, 5])

# Two dimensional array can be given by listing the rows of the array:
nump2 = np.array([[1,2,3], [4,5,6]])

# Similarly, three dimensional array can be described as a list of lists of lists:
nump3 = np.array([[[1,2], [3,4]], [[5,6], [7,8]]])

In [30]:
# Examples

# random.randint(): generates random integers within a specified range.
random_numbers = np.random.randint(1, 11, size=5) # Generate 5 random numbers between 1 and 10
random_integers1 = np.random.randint(1, 10, size=(2, 3))  # Creates a 2x3 array of random integers between 1 and 9


# np.random.rand(): generates random values from a uniform distribution between 0 and 1.
random_values = np.random.rand(3)  # Creates 3 random values between 0 & 1


# np.zeros(): creates an array filled with zeros.
zeros = np.zeros(5) # Creates a 1D array of five zeros
zeros1 = np.zeros((2, 3)) # creates a 2*3 arrays

# np.ones(): creates an array filled with ones.
ones = np.ones((2, 3))  # Creates a 2x3 array of ones

# np.empty():creates an array without initializing its values
empty = np.empty((2, 3))  # Creates a 2x3 empty array

# np.arange():generates an array with a range of values.
arange = np.arange(1, 10, 2)  # Creates a 1D array [1, 3, 5, 7, 9]

# np.linspace(): generates an array with a specified number of evenly spaced values
space = np.linspace(2, 10, 5)
print(space)

[ 2.  4.  6.  8. 10.]

In [31]:
#Importing the required packages : pandas & NumPy

import pandas as pd
import numpy as np

# Import the dataset from this url https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv
# Assign the url to a variable called url and create a dataframe named chipo.
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'


# load the dataset into a Dataframe
chipo = pd.read_csv(url, sep = '\t')

In [32]:
# Let's check the first few rows of the dataset
print(chipo.head())

   order_id  quantity                              item_name  \
0         1         1           Chips and Fresh Tomato Salsa
1         1         1                                   Izze
2         1         1                       Nantucket Nectar
3         1         1  Chips and Tomatillo-Green Chili Salsa
4         2         2                           Chicken Bowl

                                  choice_description item_price
0                                                NaN     $2.39
1                                       [Clementine]     $3.39
2                                            [Apple]     $3.39
3                                                NaN     $2.39
4  [Tomatillo-Red Chili Salsa (Hot), [Black Beans...    $16.98

In [35]:
# Before being able to calcuate, we need to ensure that our values are numerical, lets check the data type
print(chipo['item_price'].dtype)

float64

In [34]:
# now lets convert item_price to numerical values (float), since there is a dollar sign we need to remove it first.
chipo['item_price'] = chipo['item_price'].apply(lambda x: float(x[1:]))

In [36]:
# to get the total revenue, we need to get the sum of item_price column
total_revenue = np.sum(chipo['item_price'])
print("The total revenue is: ", total_revenue)

The total revenue is:  34500.16

In [37]:
# Before being able to calcuate, we need to ensure that our values are numerical, lets check the data type
print(chipo['quantity'].dtype)

#since the data type is integer, we can proceed with the calucation
average_quantity = np.mean(chipo['quantity'])
print("Average quantity of items ordered: ", average_quantity)

# Lets use the round function to display only two decimal points
print("Average quantity of items ordered: {:.2f}".format(average_quantity))

int64
Average quantity of items ordered:  1.0757247944612722
Average quantity of items ordered: 1.08